----------

## <span style="color:green">Комментарий от наставника<span>

Привет! Спасибо, что сдал проект вовремя. Ты проделал большую работу, молодец! В этой тетрадке ты найдешь мои комментарии, оформленные точно так же, как этот ;) 

Пункты, где всё отлично, я всё отмечаю галкой <span style="color:green;font-size:200%">&#10003;</span>

В комментариях я добавил два пункта.

### Что можно сделать лучше:

Пункты, которые ты можешь забрать в копилку знаний и применять в следующем проекте.   

### Что нужно доработать:

Пункты, которые нужно улучшить для того, чтобы я принял проект.

Поехали! :)

---------

----------

## <span style="color:green">Комментарий от наставника<span>

Привет! Спасибо, что быстро всё подправил

Старые комментарии я не удаляю 

Новые будут выделtны так:

## <span style="color:red">Комментарий от наставника<span>

---------

Андроник Александр 

Описание проекта
Вам предстоит подготовить проект для кредитного отдела банка. Нужно разобраться, влияет ли семейное положение и количество детей клиента на факт возврата кредита в срок. Входные данные от банка — статистика о платёжеспособности клиентов.
Результаты проекта будут учтены при построении модели кредитного скоринга — специальной системы, которая оценивает способность потенциального заёмщика вернуть кредит банку.

Инструкция по выполнению
Задание 1. Проведите исследование
Шаг 1. Откройте файл с данными /datasets/data.csv и изучите общую информацию.
Шаг 2. Предобработайте данные:
определите и заполните пропущенные значения;
замените вещественный тип данных на целочисленный;
удалите дубликаты;
выделите леммы в значениях столбца с целями получения кредита;
категоризируйте данные.
Выполняя Задание 1, описывайте свои действия в ячейках типа markdown.
Поясните:
какие пропущенные значения вы обнаружили;
возможные причины появления пропусков в данных;
по какому принципу заполнены пропуски;
какой метод вы использовали для поиска и удаления дубликатов и почему;
возможные причины появления дубликатов в данных;
какой метод вы использовали для изменения типа данных и почему;
опишите, как вы проводили лемматизацию целей кредита;
какие "словари" вы выделили для этого набора данных и почему;
Оформление:
Выполните Задание 1 в Jupyter Notebook. Эта рабочая тетрадь открывается при нажатии кнопки «Далее».
Задание 2. Опишите свои выводы
Шаг 1. Ответьте на вопросы:
Есть ли зависимость между наличием детей и возвратом кредита в срок?
Есть ли зависимость между семейным положением и возвратом кредита в срок?
Есть ли зависимость между уровнем дохода и возвратом кредита в срок?
Как разные цели кредита влияют на его возврат в срок?

Шаг 1. Откройте файл с данными /datasets/data.csv и изучите общую информацию. <span style="color:green;font-size:200%">&#10003;</span>

In [5]:
import pandas as pd
import numpy as np

from pymystem3 import Mystem
from collections import Counter
m = Mystem()

df = pd.read_csv('/datasets/data.csv')
df.tail(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
21515,1,-467.685130,28,среднее,1,женат / замужем,0,F,сотрудник,1,109486.327999,заняться образованием
21516,0,-914.391429,42,высшее,0,женат / замужем,0,F,компаньон,0,322807.776603,покупка своего жилья
21517,0,-404.679034,42,высшее,0,гражданский брак,1,F,компаньон,0,178059.553491,на покупку своего автомобиля
21518,0,373995.710838,59,СРЕДНЕЕ,1,женат / замужем,0,F,пенсионер,0,153864.650328,сделка с автомобилем
21519,1,-2351.431934,37,ученая степень,4,в разводе,3,M,сотрудник,0,115949.039788,покупка коммерческой недвижимости
21520,1,-4529.316663,43,среднее,1,гражданский брак,1,F,компаньон,0,224791.862382,операции с жильем
21521,0,343937.404131,67,среднее,1,женат / замужем,0,F,пенсионер,0,155999.806512,сделка с автомобилем
21522,1,-2113.346888,38,среднее,1,гражданский брак,1,M,сотрудник,1,89672.561153,недвижимость
21523,3,-3112.481705,38,среднее,1,женат / замужем,0,M,сотрудник,1,244093.050500,на покупку своего автомобиля
21524,2,-1984.507589,40,среднее,1,женат / замужем,0,F,сотрудник,0,82047.418899,на покупку автомобиля

In [6]:
df.describe() # Посмотрим суммарную статистику по столбцам

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21525.000000,19351.000000,21525.000000,21525.000000,21525.000000,21525.000000,1.935100e+04
mean,0.538908,63046.497661,43.293380,0.817236,0.972544,0.080883,1.674223e+05
std,1.381587,140827.311974,12.574584,0.548138,1.420324,0.272661,1.029716e+05
min,-1.000000,-18388.949901,0.000000,0.000000,0.000000,0.000000,2.066726e+04
25%,0.000000,-2747.423625,33.000000,1.000000,0.000000,0.000000,1.030532e+05
50%,0.000000,-1203.369529,42.000000,1.000000,0.000000,0.000000,1.450179e+05
75%,1.000000,-291.095954,53.000000,1.000000,1.000000,0.000000,2.034351e+05
max,20.000000,401755.400475,75.000000,4.000000,4.000000,1.000000,2.265604e+06

Посмотрим на типы переменных в dataframe

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
children            21525 non-null int64
days_employed       19351 non-null float64
dob_years           21525 non-null int64
education           21525 non-null object
education_id        21525 non-null int64
family_status       21525 non-null object
family_status_id    21525 non-null int64
gender              21525 non-null object
income_type         21525 non-null object
debt                21525 non-null int64
total_income        19351 non-null float64
purpose             21525 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

Проблемы подлежащие решению 
- отрицательные значения в детях, в днях стажа
- отсутствую строки в днях стажа и доходе
- некачественные названия столбцов
- некорректные типы данных — в днях стажа и в доходе плавающая точка
- неудобные данные для анализа — дни стажа лучше перевести в года
- прыгающий регистр букв в образовании
- есть дублирующие признаки — избыточны образование и его идентификатор и такая же проблема у семейного положения
- минимальное значение в возрасте — 0

----------

## <span style="color:green">Комментарий от наставника<span>

Отличное начало работы. Классно, что сделал список проблем. Сразу ясно куда двигаться.

### Что можно сделать лучше:

1. Если столбцов будет слишком много проверять пропуски через `info()` может оказаться не удобно и увеличивает шанс ошибки. Как вариант можно написать код, который будет выводить долю заполненных значений и использовать его совместно с `.info()`. Это может пригодиться, если например мы решим избавиться от столбцов у которых уровень заполняемости ниже какого-то значения.
1. Подумать над возможными причинами проблем в данных и зафиксировать их.
1. Желательно имена переменных давать со смыслом. Название переменной df, к сожалению не отражает сути хранимых в нем данных
---------

Шаг 2. Предобработайте данные: <span style="color:green;font-size:200%">&#10003;</span>

In [8]:
df.columns.tolist() # Получим список

['children',
 'days_employed',
 'dob_years',
 'education',
 'education_id',
 'family_status',
 'family_status_id',
 'gender',
 'income_type',
 'debt',
 'total_income',
 'purpose']

In [9]:
# Переименуем столбцы
cols = ['number_of_children',
        'days_employed',
        'client_age_in_years',
        'education_level',
        'education_level_id',
        'family_status',
        'family_status_id',
        'gender',
        'employment_type',
        'credit_repayment_status',
        'monthly_income',
        'credit_purpose'
       ]
df.set_axis(cols, axis='columns', inplace=True)

In [10]:
# Проверим , что столбцы переименованы
df.columns.tolist()

['number_of_children',
 'days_employed',
 'client_age_in_years',
 'education_level',
 'education_level_id',
 'family_status',
 'family_status_id',
 'gender',
 'employment_type',
 'credit_repayment_status',
 'monthly_income',
 'credit_purpose']

In [11]:
# Необходимо посчитатать  суммарное количество пропусков
df.isnull().sum()

number_of_children            0
days_employed              2174
client_age_in_years           0
education_level               0
education_level_id            0
family_status                 0
family_status_id              0
gender                        0
employment_type               0
credit_repayment_status       0
monthly_income             2174
credit_purpose                0
dtype: int64

Получилось одинаковое количество в днях работы и дохода в месяц. Возможно люди не работали или данные неверны

In [12]:
# Заменим пропуски на нули.
df['days_employed'] = df['days_employed'].fillna(0)

In [13]:
df['monthly_income'] = df['monthly_income'].fillna(0)

In [14]:
# Проверим замену
df.isnull().sum()

number_of_children         0
days_employed              0
client_age_in_years        0
education_level            0
education_level_id         0
family_status              0
family_status_id           0
gender                     0
employment_type            0
credit_repayment_status    0
monthly_income             0
credit_purpose             0
dtype: int64

МЫ видим одинаковое количество пропусков в днях работы и в доходе в месяц. Возможно данные некорректные . Нужно посмотреть подробно .

In [15]:
# Попробуем заменить пропуски на нули 
df['days_employed'] = df['days_employed'].fillna(0)

In [16]:
df['monthly_income'] = df['monthly_income'].fillna(0)

In [17]:
# Проверим замену
df.isnull().sum()

number_of_children         0
days_employed              0
client_age_in_years        0
education_level            0
education_level_id         0
family_status              0
family_status_id           0
gender                     0
employment_type            0
credit_repayment_status    0
monthly_income             0
credit_purpose             0
dtype: int64

----------

## <span style="color:green">Комментарий от наставника<span>

Дубль кода, видимо опечатка просто

---------

In [18]:
# Посмотрим есть ли дубли
df.duplicated().sum()

54

In [19]:
# Удалим дубли и сбросим индекс
df = df.drop_duplicates().reset_index(drop=True)

In [20]:
# Проверим удалились ли дубли
df.duplicated().sum()

0

In [17]:
import pandas as pd
import numpy as np

from pymystem3 import Mystem
from collections import Counter
m = Mystem()

 
def check(df):
    df = pd.read_csv('/datasets/data.csv')
    df = df.drop_duplicates().reset_index(drop=True)
    df = df.duplicated().sum()
    try: 
        
        return  ('Дубликатов нет ', check)
    except:
        return('Что то пошло не так')

In [16]:
print(df)

0

In [22]:
df.head(10)

,number_of_children,days_employed,client_age_in_years,education_level,education_level_id,family_status,family_status_id,gender,employment_type,credit_repayment_status,monthly_income,credit_purpose
0,1,-8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья
1,1,-4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля
2,0,-5623.422610,33,Среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья
3,3,-4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование
4,0,340266.072047,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу
5,0,-926.185831,27,высшее,0,гражданский брак,1,M,компаньон,0,255763.565419,покупка жилья
6,0,-2879.202052,43,высшее,0,женат / замужем,0,F,компаньон,0,240525.971920,операции с жильем
7,0,-152.779569,50,СРЕДНЕЕ,1,женат / замужем,0,M,сотрудник,0,135823.934197,образование
8,2,-6929.865299,35,ВЫСШЕЕ,0,гражданский брак,1,F,сотрудник,0,95856.832424,на проведение свадьбы
9,0,-2188.756445,41,среднее,1,женат / замужем,0,M,сотрудник,0,144425.938277,покупка жилья для семьи

----------

## <span style="color:green">Комментарий от наставника<span>


### Что можно сделать лучше:

Перед удалением полезно оценить объем удаляемых данных, что бы не потерять в информативности. Если объем большой, то стоит подумать, что с ними еще можно сделать. Если нет, то информативность не будет потеряна

---------

Теперь мы иследуем столбцы по отдельности

In [23]:
# Дети 
df['number_of_children'].unique()

array([ 1,  0,  3,  2, -1,  4, 20,  5])

In [24]:
# Значения -1 и 20 выглядят подозрительно . Подсчитаем количество таких строк
df[df['number_of_children'] == -1]['number_of_children'].count()

47

In [25]:
# Заменим -1 на 1
df['number_of_children'] = df['number_of_children'].replace(-1, 1)

In [26]:
# Проверим замену
df[df['number_of_children'] == -1]['number_of_children'].count()

0

In [27]:
# Подсчитаем количество строк с 20 детьми
df[df['number_of_children'] == 20]['number_of_children'].count()

76

In [28]:
# Многовато, сгруппируем по возрасту, чтобы убедиться в корректности данных
df[df['number_of_children'] == 20].groupby('client_age_in_years')['client_age_in_years'].count()

client_age_in_years
0     1
21    1
23    1
24    1
25    1
26    1
27    2
29    2
30    3
31    2
32    2
33    2
34    3
35    2
36    2
37    4
38    1
39    1
40    4
41    2
42    3
43    2
44    2
45    3
46    3
48    1
49    3
50    3
51    1
52    1
53    1
54    1
55    1
56    5
57    1
59    2
60    1
61    1
62    1
64    1
69    1
Name: client_age_in_years, dtype: int64

In [29]:
df['number_of_children'].value_counts()

0     14107
1      4856
2      2052
3       330
20       76
4        41
5         9
Name: number_of_children, dtype: int64

Я предополагаю , что семьи с 20 детьми это ошибка . Заменим их на 2

In [30]:
df['number_of_children'] = df['number_of_children'].replace(20, 2)

In [31]:
# Проверим
df['number_of_children'].unique()

array([1, 0, 3, 2, 4, 5])

----------

## <span style="color:green">Комментарий от наставника<span>

Всё здорово!

---------

In [32]:
#  Что у нас с трудовым стажем ?
df['days_employed'].describe()

count     21471.000000
mean      56821.423140
std      135010.270744
min      -18388.949901
25%       -2522.536607
50%        -989.271304
75%           0.000000
max      401755.400475
Name: days_employed, dtype: float64

In [33]:
# Выглядят непонятно . Есть отрицательные значения, значения не в целых числах да и вообще дни не очень удобно использовать.
# Разберемся  с отрицательными значениями

df['days_employed'] = df['days_employed'].abs()

In [34]:
df['days_employed'].describe()

count     21471.000000
mean      60307.713617
std      133489.355354
min           0.000000
25%         620.736110
50%        1818.689386
75%        4794.911909
max      401755.400475
Name: days_employed, dtype: float64

In [35]:
# Стало лучше, но максимальные значения выглядят как то странно 
# Если предположить, что он работал с 16 лет, то:
max_days_of_employment = (df['client_age_in_years'].max() - 16) * 365
max_days_of_employment # Получим количество дней, по которым можно сделать отсев

21535

In [36]:
df[df['days_employed'] > max_days_of_employment]['days_employed'].count() / 21525 * 100
# Многовато,  переведем   в года и добавим новый столбец не помешает

16.004645760743323

In [37]:
df['years_employed'] = df['days_employed'] / 365

----------

## <span style="color:green">Комментарий от наставника<span>


Небольшая ремарка, лучше делить на 365.25 ;-)

---------

In [38]:
df['years_employed'] = df['years_employed'].astype(int)

In [39]:
# Удалим столбец с днями, оставим только года 
del df['days_employed']

In [40]:
df.head()

,number_of_children,client_age_in_years,education_level,education_level_id,family_status,family_status_id,gender,employment_type,credit_repayment_status,monthly_income,credit_purpose,years_employed
0,1,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья,23
1,1,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля,11
2,0,33,Среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья,15
3,3,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование,11
4,0,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу,932

In [41]:
# Разберемся с возрастом
df['client_age_in_years'].describe()

count    21471.000000
mean        43.279074
std         12.574291
min          0.000000
25%         33.000000
50%         42.000000
75%         53.000000
max         75.000000
Name: client_age_in_years, dtype: float64

In [42]:
# Подсчитаем людей с возрастом меньше 0, 10 и 18 лет, таких 101
df[df['client_age_in_years'] == 0]['client_age_in_years'].count()

101

In [43]:
df[df['years_employed'] > 70].groupby(['client_age_in_years'])['client_age_in_years'].count()

client_age_in_years
0      17
22      1
26      2
27      3
28      1
31      1
32      3
33      2
34      3
35      1
36      3
37      5
38      8
39      4
40      7
41      6
42      9
43      9
44     10
45     11
46     13
47     13
48     20
49     30
50     61
51     73
52     95
53    105
54    145
55    162
56    184
57    212
58    208
59    254
60    243
61    214
62    235
63    192
64    179
65    136
66    139
67    132
68     80
69     74
70     54
71     48
72     28
73      6
74      4
Name: client_age_in_years, dtype: int64

----------

## <span style="color:green">Комментарий от наставника<span>

Хорошая работа. Есть небольшая просьба на будущее, что упростит проверку и понимании проделанной работе в будущем: комментарии к коду писать в markdown ячейках. Так читабельнее и юзерфрендли.

---------

In [44]:
# Разберемся с образованием
len(df['education_level'].unique())
# Уников 15, а в ID уников 5

15

In [45]:
df['education_level_id'].unique()

array([0, 1, 2, 3, 4])

In [46]:
# Приведем строки к нижнему регистру
df['education_level'] = df['education_level'].str.lower()

In [47]:
df['education_level'].unique()

array(['высшее', 'среднее', 'неоконченное высшее', 'начальное',
       'ученая степень'], dtype=object)

In [48]:
# Разберемся с семейным статусом, с количеством порядок, но приведем все к нижнему регистру
df['family_status'] = df['family_status'].str.lower()

In [49]:
df['family_status'].unique()

array(['женат / замужем', 'гражданский брак', 'вдовец / вдова',
       'в разводе', 'не женат / не замужем'], dtype=object)

In [50]:
# Посмотрим что с полом
df['gender'].unique()

array(['F', 'M', 'XNA'], dtype=object)

In [51]:
# Есть одна запись с чем-то непонятным
df[df['gender'] == 'XNA'].count()

number_of_children         1
client_age_in_years        1
education_level            1
education_level_id         1
family_status              1
family_status_id           1
gender                     1
employment_type            1
credit_repayment_status    1
monthly_income             1
credit_purpose             1
years_employed             1
dtype: int64

In [52]:
# Разберемся со статусама. Тут все ок.
df['employment_type'].unique()

array(['сотрудник', 'пенсионер', 'компаньон', 'госслужащий',
       'безработный', 'предприниматель', 'студент', 'в декрете'],
      dtype=object)

In [53]:
# Смотреть на доходы с 6 знаками после запятой неудобно.
# Посмотрим на доходы, сначала приведем к целочисленным значениям
df['monthly_income'] = df['monthly_income'].astype(int)

In [54]:
df.head()

,number_of_children,client_age_in_years,education_level,education_level_id,family_status,family_status_id,gender,employment_type,credit_repayment_status,monthly_income,credit_purpose,years_employed
0,1,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875,покупка жилья,23
1,1,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080,приобретение автомобиля,11
2,0,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885,покупка жилья,15
3,3,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628,дополнительное образование,11
4,0,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616,сыграть свадьбу,932

In [55]:
# Узнаем количество уникальных значений — 38
unique_credit_purposes = df['credit_purpose'].unique().tolist()
unique_credit_purposes

['покупка жилья',
 'приобретение автомобиля',
 'дополнительное образование',
 'сыграть свадьбу',
 'операции с жильем',
 'образование',
 'на проведение свадьбы',
 'покупка жилья для семьи',
 'покупка недвижимости',
 'покупка коммерческой недвижимости',
 'покупка жилой недвижимости',
 'строительство собственной недвижимости',
 'недвижимость',
 'строительство недвижимости',
 'на покупку подержанного автомобиля',
 'на покупку своего автомобиля',
 'операции с коммерческой недвижимостью',
 'строительство жилой недвижимости',
 'жилье',
 'операции со своей недвижимостью',
 'автомобили',
 'заняться образованием',
 'сделка с подержанным автомобилем',
 'получение образования',
 'автомобиль',
 'свадьба',
 'получение дополнительного образования',
 'покупка своего жилья',
 'операции с недвижимостью',
 'получение высшего образования',
 'свой автомобиль',
 'сделка с автомобилем',
 'профильное образование',
 'высшее образование',
 'покупка жилья для сдачи',
 'на покупку автомобиля',
 'ремонт жилью',
 'заняться высшим образованием']

In [56]:
m = Mystem()
string = '; '.join(unique_credit_purposes)
print(string)

покупка жилья; приобретение автомобиля; дополнительное образование; сыграть свадьбу; операции с жильем; образование; на проведение свадьбы; покупка жилья для семьи; покупка недвижимости; покупка коммерческой недвижимости; покупка жилой недвижимости; строительство собственной недвижимости; недвижимость; строительство недвижимости; на покупку подержанного автомобиля; на покупку своего автомобиля; операции с коммерческой недвижимостью; строительство жилой недвижимости; жилье; операции со своей недвижимостью; автомобили; заняться образованием; сделка с подержанным автомобилем; получение образования; автомобиль; свадьба; получение дополнительного образования; покупка своего жилья; операции с недвижимостью; получение высшего образования; свой автомобиль; сделка с автомобилем; профильное образование; высшее образование; покупка жилья для сдачи; на покупку автомобиля; ремонт жилью; заняться высшим образованием

In [57]:
lemmas = m.lemmatize(string)
print(Counter(lemmas))

Counter({' ': 59, '; ': 37, 'покупка': 10, 'недвижимость': 10, 'автомобиль': 9, 'образование': 9, 'жилье': 7, 'с': 5, 'операция': 4, 'на': 4, 'свой': 4, 'свадьба': 3, 'строительство': 3, 'получение': 3, 'высокий': 3, 'дополнительный': 2, 'для': 2, 'коммерческий': 2, 'жилой': 2, 'подержать': 2, 'заниматься': 2, 'сделка': 2, 'приобретение': 1, 'сыграть': 1, 'проведение': 1, 'семья': 1, 'собственный': 1, 'со': 1, 'профильный': 1, 'сдача': 1, 'ремонт': 1, '\n': 1})

----------

## <span style="color:green">Комментарий от наставника<span>


Всё верно!

---------

Выделим цели кредитов :

автомобиль
недвижимость
образование
свадьба
Выводы
Заполнили пропуски, удалили дубли, выделили леммы. В датасете остались явно некорректные значения, но на последующий анализ они повлиять не должны.

НОВОЕ РЕШЕНИЕ .В приниципе  можно сделать по другому .

Шаг 1. Ответьте на вопросы:
Есть ли зависимость между наличием детей и возвратом кредита в срок?
Есть ли зависимость между семейным положением и возвратом кредита в срок?
Есть ли зависимость между уровнем дохода и возвратом кредита в срок?
Как разные цели кредита влияют на его возврат в срок?

Выделим из полученного словаря верхние категории 
недвижимость/жилье -> недвижимость
автомобиль
свадьба
образование

In [58]:
df['purpose_credit_category'] = df.credit_purpose.apply(lambda x: 
            'операции с недвижимостью' if ('недвижимость' in m.lemmatize(str(x))) or 'жилье' in m.lemmatize(str(x))
            else 'автомобиль' if 'автомобиль' in m.lemmatize(str(x))
            else 'свадьба' if 'свадьба' in m.lemmatize(str(x))
            else 'образование' if 'образование' in m.lemmatize(str(x))
            else 'другое')

In [59]:
df.head()

,number_of_children,client_age_in_years,education_level,education_level_id,family_status,family_status_id,gender,employment_type,credit_repayment_status,monthly_income,credit_purpose,years_employed,purpose_credit_category
0,1,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875,покупка жилья,23,операции с недвижимостью
1,1,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080,приобретение автомобиля,11,автомобиль
2,0,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885,покупка жилья,15,операции с недвижимостью
3,3,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628,дополнительное образование,11,образование
4,0,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616,сыграть свадьбу,932,свадьба

Проверим что все категории правильно выделены из лемм и NaN значения отсутствуют

In [60]:
df.purpose_credit_category.unique()

array(['операции с недвижимостью', 'автомобиль', 'образование', 'свадьба'],
      dtype=object)

In [61]:
df_purpose = df.pivot_table(index=['purpose_credit_category'], columns='credit_repayment_status', values='family_status_id', aggfunc='count').\
    reset_index()

In [62]:
df_purpose.columns =  ['purpose_credit_category','no_debt','yes_debt']
df_purpose

    purpose_credit_category  no_debt  yes_debt
0                автомобиль     3905       403
1               образование     3644       370
2  операции с недвижимостью    10032       782
3                   свадьба     2149       186

Посчитаем конверсию в задолженность по каждой группе

In [63]:
df_purpose['all_people'] = df_purpose['no_debt']+df_purpose['yes_debt']
df_purpose['converison_rate_in_debt'] = df_purpose['yes_debt']/df_purpose['all_people']
df_purpose

,purpose_credit_category,no_debt,yes_debt,all_people,converison_rate_in_debt
0,автомобиль,3905,403,4308,0.093547
1,образование,3644,370,4014,0.092177
2,операции с недвижимостью,10032,782,10814,0.072314
3,свадьба,2149,186,2335,0.079657

Как мы видим самые большие проблемы с со недвижимостью и со свадьбой.

Есть ли зависимость между наличием детей и возвратом кредита в срок?

In [64]:
#Добавим наличие детей для группировки
df['children_yes_or_no'] = np.where(df.number_of_children > 0, '1', '0')

In [65]:
deti = df.pivot_table(index=['children_yes_or_no'], columns='credit_repayment_status', values='family_status_id', aggfunc='count').\
    reset_index()

In [66]:
deti.columns = ['children_yes_or_no','no_debt','yes_debt']
deti['all_people'] = deti['yes_debt']+deti['no_debt']

In [67]:
deti['conversion_rate_in_debt'] = deti['yes_debt']/deti['all_people']

Посчитаем конверсию в задолженность по каждой группе

In [68]:
deti

  children_yes_or_no  no_debt  yes_debt  all_people  conversion_rate_in_debt
0                  0    13044      1063       14107                 0.075353
1                  1     6686       678        7364                 0.092070

----------

## <span style="color:green">Комментарий от наставника<span>


Разделить на две группы идея хорошая, хотя я имел ввиду более сегментированный подход

---------

Есть ли зависимость между семейным положением и возвратом кредита в срок? С деньми отдают хуже , но опять же разница незначителна.

In [69]:
family = df.pivot_table(index=['family_status'], columns='credit_repayment_status', values='family_status_id', aggfunc='count').\
    reset_index()

In [70]:
family.columns = ['family_status','no_debt','yes_debt']
family

           family_status  no_debt  yes_debt
0              в разводе     1110        85
1         вдовец / вдова      896        63
2       гражданский брак     3775       388
3        женат / замужем    11413       931
4  не женат / не замужем     2536       274

Посчитаем конверсию в задолженность по каждой группе

In [71]:
family['all_people'] = family['no_debt']+family['yes_debt']
family['conversion_rate_in_debt'] = family['yes_debt']/family['all_people']

In [72]:
family

,family_status,no_debt,yes_debt,all_people,conversion_rate_in_debt
0,в разводе,1110,85,1195,0.071130
1,вдовец / вдова,896,63,959,0.065693
2,гражданский брак,3775,388,4163,0.093202
3,женат / замужем,11413,931,12344,0.075421
4,не женат / не замужем,2536,274,2810,0.097509

Как мы видим данные противоречивые . Разве что самые низкие у вдовцов и разведенных .

ЭТО СТАРОЕ РЕШЕНИЕ

In [73]:
number_of_children_set = df.groupby('number_of_children')['credit_repayment_status'].sum() / \
    df.groupby('number_of_children')['credit_repayment_status'].count() * 100

In [74]:
print(number_of_children_set)

number_of_children
0    7.535266
1    9.163921
2    9.492481
3    8.181818
4    9.756098
5    0.000000
Name: credit_repayment_status, dtype: float64

In [75]:
grouped_number_of_children = df.groupby('number_of_children')['credit_repayment_status'].count()
grouped_number_of_children

number_of_children
0    14107
1     4856
2     2128
3      330
4       41
5        9
Name: credit_repayment_status, dtype: int64

In [76]:
children_pivot = df.pivot_table(index = ['number_of_children'], \
                                columns = ['credit_repayment_status'], \
                                values = 'credit_purpose', aggfunc='count')

children_pivot['ratio'] = children_pivot[1] / children_pivot[0] * 100
children_pivot
# Не смотря на то, что часть данных потерялась, на выводах это не сказывается

credit_repayment_status        0       1      ratio
number_of_children
0                        13044.0  1063.0   8.149341
1                         4411.0   445.0  10.088415
2                         1926.0   202.0  10.488058
3                          303.0    27.0   8.910891
4                           37.0     4.0  10.810811
5                            9.0     NaN        NaN

Люди с детьми или без отдают кредиты примерно на одном и том же уровне
Можно отметить, что люди с 5 детьми показывают 0, но выборка по ним не репрезентативна. Бездетные отдают кредиты хуже.

----------

## <span style="color:green">Комментарий от наставника<span>

### Что нужно доработать:

Думаю анализ AS IS в разрезе детей не самое лучшее в данной ситуации, из-за сильноо дисбаланса количества. Подумай как еще можно сгруппировтать.

---------

Зависимость между семейным положением и возвратом кредита в срок

In [77]:
family_status_set = df.groupby('family_status')['credit_repayment_status'].sum() / \
      df.groupby('family_status')['credit_repayment_status'].count() * 100

In [78]:
family_status_set

family_status
в разводе                7.112971
вдовец / вдова           6.569343
гражданский брак         9.320202
женат / замужем          7.542126
не женат / не замужем    9.750890
Name: credit_repayment_status, dtype: float64

In [79]:
family_status_pivot = df.pivot_table(index=['family_status'], columns=['credit_repayment_status'], values='monthly_income', aggfunc='count')
family_status_pivot['ratio'] = family_status_pivot[1] / family_status_pivot[0] * 100
family_status_pivot

credit_repayment_status      0    1      ratio
family_status
в разводе                 1110   85   7.657658
вдовец / вдова             896   63   7.031250
гражданский брак          3775  388  10.278146
женат / замужем          11413  931   8.157364
не женат / не замужем     2536  274  10.804416

Семейное положение влияет
Самые низкие показатели у разведенных и вдов — можно предположить, 
что возвращаемость кредитов зависит в том числе от наличия кормильца или супруга в семье.

Зависимость между уровнем дохода и возвратом кредита в срок

In [80]:
df['monthly_income'].quantile([0.25,0.5,0.75])

0.25     88946.5
0.50    135716.0
0.75    195751.5
Name: monthly_income, dtype: float64

In [81]:
# Так как мы не знает социального контекста, то распределим уровень дохода на 4 группы, присвоим статусы каждой группе
def income_status(monthly_income):
    if monthly_income <= 88946.5:
            return 'Низкий уровень дохода'
    if monthly_income <= 135716.0:
            return 'Средний уровень дохода'
    if monthly_income < 195751.5:
            return 'Высокий уровень дохода'
    return 'Сверхвысокий уровень дохода'

----------

## <span style="color:green">Комментарий от наставника<span>

Клаасно что применял квантили, но почему в функция захардкодил значения квантилей?

### Что нужно доработать:

Хардкодить значения квантилей не лучшая идея. Давай попробуем сделать это более универсальным.

---------

In [82]:
df['income_status'] = df['monthly_income'].apply(income_status)

In [83]:
df.head()

,number_of_children,client_age_in_years,education_level,education_level_id,family_status,family_status_id,gender,employment_type,credit_repayment_status,monthly_income,credit_purpose,years_employed,purpose_credit_category,children_yes_or_no,income_status
0,1,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875,покупка жилья,23,операции с недвижимостью,1,Сверхвысокий уровень дохода
1,1,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080,приобретение автомобиля,11,автомобиль,1,Средний уровень дохода
2,0,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885,покупка жилья,15,операции с недвижимостью,0,Высокий уровень дохода
3,3,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628,дополнительное образование,11,образование,1,Сверхвысокий уровень дохода
4,0,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616,сыграть свадьбу,932,свадьба,0,Высокий уровень дохода

In [84]:
monthly_income_set = df.groupby('income_status')['credit_repayment_status'].sum() / \
      df.groupby('income_status')['credit_repayment_status'].count() * 100

In [85]:
monthly_income_set.sort_values()

income_status
Сверхвысокий уровень дохода    7.134873
Низкий уровень дохода          7.805514
Средний уровень дохода         8.476155
Высокий уровень дохода         9.018073
Name: credit_repayment_status, dtype: float64

In [86]:
monthly_income_pivot = df.pivot_table(index=['income_status'], columns=['credit_repayment_status'], values='education_level_id', aggfunc='count')
monthly_income_pivot['ratio'] = monthly_income_pivot[1] / monthly_income_pivot[0] * 100
monthly_income_pivot

credit_repayment_status         0    1     ratio
income_status
Высокий уровень дохода       4883  484  9.911939
Низкий уровень дохода        4949  419  8.466357
Сверхвысокий уровень дохода  4985  383  7.683049
Средний уровень дохода       4913  455  9.261144

In [87]:
# Проверим количество людей в каждой из групп
df['income_status'].value_counts(normalize = True)

Средний уровень дохода         0.250012
Низкий уровень дохода          0.250012
Сверхвысокий уровень дохода    0.250012
Высокий уровень дохода         0.249965
Name: income_status, dtype: float64

Есть незначительная разница в возвращаемости кредитов от уровня доходов
Хуже всего покатель у людей со сверхвысокими и низкими доходами. Если зависимость возвращаемости 
кредитов у людей с низкими доходами очевидна, то сверхвысокие непонятно

Как разные цели кредита влияют на его возврат в срок?

In [88]:
# Напишем функцию для более точного отображения целей кредита
def credit_purpose_status(credit_purpose):
        if 'образован' in credit_purpose:
             return 'Образование'
        if 'авто' in credit_purpose:
            return 'Автомобиль'
        if 'свадьба' in credit_purpose:
            return 'Свадьба'
        if 'жиль' or 'недв' in credit_purpose:
             return 'Недвижимость'
        return 'Ошибка классификации'

----------

## <span style="color:green">Комментарий от наставника<span>

Отличное решение. Ты выделил 4 категории.


### Что нужно доработать:

Твое решение для этой задачи наиболее оптимальное. А что делать если категорий больше?

---------

In [89]:
df['credit_purpose_status'] = df['credit_purpose'].apply(credit_purpose_status)

In [90]:
credit_purpose_set = df.groupby('credit_purpose_status')['credit_repayment_status'].sum() / \
      df.groupby('credit_purpose_status')['credit_repayment_status'].count() * 100

In [91]:
credit_purpose_set.sort_values()

credit_purpose_status
Недвижимость    7.316284
Свадьба         8.070618
Образование     9.217738
Автомобиль      9.354689
Name: credit_repayment_status, dtype: float64

In [92]:
# Попробуем через map(), составим словарь из двух списков
credit_purpose_keys= []
credit_purpose_list = list(df.credit_purpose.unique())
for value in range(len(credit_purpose_list)):
    if 'образован' in credit_purpose_list[value]:
        credit_purpose_keys.append('Образование')
    elif 'авто' in credit_purpose_list[value]:
        credit_purpose_keys.append('Автомобиль')
    elif 'свадь' in credit_purpose_list[value]:
        credit_purpose_keys.append('Свадьба')
    else:
        credit_purpose_keys.append('Недвижимость')
        
credit_purpose_keys

['Недвижимость',
 'Автомобиль',
 'Образование',
 'Свадьба',
 'Недвижимость',
 'Образование',
 'Свадьба',
 'Недвижимость',
 'Недвижимость',
 'Недвижимость',
 'Недвижимость',
 'Недвижимость',
 'Недвижимость',
 'Недвижимость',
 'Автомобиль',
 'Автомобиль',
 'Недвижимость',
 'Недвижимость',
 'Недвижимость',
 'Недвижимость',
 'Автомобиль',
 'Образование',
 'Автомобиль',
 'Образование',
 'Автомобиль',
 'Свадьба',
 'Образование',
 'Недвижимость',
 'Недвижимость',
 'Образование',
 'Автомобиль',
 'Автомобиль',
 'Образование',
 'Образование',
 'Недвижимость',
 'Автомобиль',
 'Недвижимость',
 'Образование']

In [93]:
credit_purpose_list

['покупка жилья',
 'приобретение автомобиля',
 'дополнительное образование',
 'сыграть свадьбу',
 'операции с жильем',
 'образование',
 'на проведение свадьбы',
 'покупка жилья для семьи',
 'покупка недвижимости',
 'покупка коммерческой недвижимости',
 'покупка жилой недвижимости',
 'строительство собственной недвижимости',
 'недвижимость',
 'строительство недвижимости',
 'на покупку подержанного автомобиля',
 'на покупку своего автомобиля',
 'операции с коммерческой недвижимостью',
 'строительство жилой недвижимости',
 'жилье',
 'операции со своей недвижимостью',
 'автомобили',
 'заняться образованием',
 'сделка с подержанным автомобилем',
 'получение образования',
 'автомобиль',
 'свадьба',
 'получение дополнительного образования',
 'покупка своего жилья',
 'операции с недвижимостью',
 'получение высшего образования',
 'свой автомобиль',
 'сделка с автомобилем',
 'профильное образование',
 'высшее образование',
 'покупка жилья для сдачи',
 'на покупку автомобиля',
 'ремонт жилью',
 'заняться высшим образованием']

In [94]:
# Сшили словарь, теперь можно передать в map()
credit_purpose_dict = dict(zip(credit_purpose_list, credit_purpose_keys))

In [95]:
# Готово, работает, хотя не уверен, что нужно было действовать именно так
df['credit_purpose_status'] = df['credit_purpose'].map(credit_purpose_dict)

In [96]:
credit_purpose_pivot = df.pivot_table(index=['credit_purpose_status'], columns=['credit_repayment_status'], values='education_level_id', aggfunc='count')
credit_purpose_pivot['ratio'] = credit_purpose_pivot[1] / credit_purpose_pivot[0] * 100
credit_purpose_pivot

credit_repayment_status      0    1      ratio
credit_purpose_status
Автомобиль                3905  403  10.320102
Недвижимость             10032  782   7.795056
Образование               3644  370  10.153677
Свадьба                   2149  186   8.655188

Цели кредита влияют
Хуже всего выглядят свадьбы и недвижимость. Выглядит логично, ипотека — пожалуй, самая крупная кредитная и рисковая сделка для частного лица. Свадьбы — это не инвестиционный проект и это неликвидный кредит, который по сути проедают.Люди не берите кредиты на свадьбы.

Этап 4. Результаты исследования
Есть зависимости между целями кредита, семейным положением, уровнем дохода и количеством детей в семье. Нельзя сказать, что они кардинально отличаются, но 2% на больших числах могут оказать существенное влияние на кредитный портфель банка. Особое внимание следует уделить вдовам/вдовцам или молодоженам — с ними могут риски по невозврату кредитов выше.
Мои рекомендации 
- Уделить внимание правилам валидации на сервере, чтобы больше не сталкиваться с проблемой дублей.
- Продумать сценарий, когда отличается дата или время заявки, а уникальный идентификатор пользователя один и тот же, 
  иначе фактически дубли будут, но метод duplicated() их не найдет.
- Считать стаж работы в годах, пользователи чаще всего не знают свой стаж в днях.
- Показывать операторам в банке или пользователям на сайте подсказки заранее, когда вводят сверхвысокие/сверхнизкие
  значения в полях: возраст, стаж, количество детей.
- Блокировать отправку заявок с заведомо некорректными значениями, которые могут быть важны для анализа, например,
  с отрицательным количеством детей.

----------

## <span style="color:green">Комментарий от наставника<span>

С почином! Ты молодец! Очень понравилась твоя работа. Вот несколько выводов:

1. У тебя хороший и понятный код
1. Ты четко и понятно формулируешь мысли и гипотезы. Они прекрасно связаны с рельной работой аналитика
1. Все цифры прозрачно представлены, не возникает вопросов об их проихождении и выводах построенных на них
1. Работа хорошо структурирована
1. Подумай как можно использовать `try - except`
1. Имеет смысл также перечислить проблемы с данными и дать комментарий о том, могли ли они повлиять на результат
1. Как от Аналитика от тебя ждут не только констатацию факта и выводы, но и возможные предложения как улучшить существующую ситуацию. Подумай над этим


**Доделай пункты отмеченные: "Что нужно доработать" и пункты 5,6 из этого списка и я жду твой проект**

---------

----------

## <span style="color:green">Комментарий от наставника<span>

Просьба повнимательнее прочитать мои прошлые комментарии, не всё реализовано

`try - except` не реализовано

---------